code-review/NRB_3471_3546/База_Стало/Documents/ПринудительнаяБлокировкаЦБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПринудительнаяБлокировкаЦБ</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидКорпоративногоДействия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКорпоративныхДействий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоХраненияСчетДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепоМХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоХраненияСчетДепоРаздел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепоМХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Комментарий1024</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокДанныхБлокировки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Клиент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетДепо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетДепоРаздел</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РазделыСчетаДепо</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦеннаяБумагаСтатус</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыЦБ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/AccumulationRegisters/ОстаткиЦБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиЦБ</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СчетДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РазделСчетаДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦБ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДепоМХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепоМХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РазделСчетаДепоМХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепоМХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусЦБ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЦБ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Documents/ПринудительнаяБлокировкаЦБ/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьНовыйНомер();
	
	Если Не ЭтоНовый() Тогда
		Изменил	= ПараметрыСеанса.ТекущийПользователь;
	Иначе
		Автор	= ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	// Процеряем. Если ТЧ блокировки пустая и режим записи проведение, то отказ
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение И СписокДанныхБлокировки.Количество()=0 Тогда
		Отказ	= Истина;
		#Если Клиент Тогда
			Сообщить("В таблице блокировки нет данных!");
		#Иначе
			ЗаписьЖурналаРегистрации("Принудительная блокировка ЦБ", УровеньЖурналаРегистрации.Информация, ЭтотОбъект.Метаданные(), , "В таблице блокировки нет данных!"); 
		#КонецЕсли
		Возврат;
	КонецЕсли;	
	// Проверяем совпадает ли количество в таблице блокировки и общее указанное количество к блокировке
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение И Не СписокДанныхБлокировки.Итог("Количество") = Количество Тогда
		Отказ	= Истина;
		#Если Клиент Тогда
			Сообщить("В таблице блокировки количество 'Ценных бумаг' к блокировке не совпадает с количеством по документу - Количество по документу: "+Количество+" - количество по блокировке: "+СписокДанныхБлокировки.Итог("Количество"));
		#Иначе
			ЗаписьЖурналаРегистрации("Принудительная блокировка ЦБ", УровеньЖурналаРегистрации.Информация, ЭтотОбъект.Метаданные(), , "В таблице блокировки количество 'Ценных бумаг' к блокировке не совпадает с количеством по документу - Количество по документу: "+Количество+" - количество по блокировке: "+СписокДанныхБлокировки.Итог("Количество")); 
		#КонецЕсли
		Возврат;
	КонецЕсли;	
	// Проверяем есть ли отрицательные цифры. Если есть, то блокировка не возможно и надо разобраться с остатками!
	Для Каждого Строка Из СписокДанныхБлокировки Цикл
		Если Строка.Количество < 0  Тогда
			Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
				Отказ	= Истина;
			КонецЕсли;
			#Если Клиент Тогда
				Сообщить("В таблице блокировки есть данные с отрицательным количеством по: " + Строка.Клиент+" / "+Строка.СчетДепо+" / "+Строка.СчетДепоРаздел+" / Количество: "+Строка.Количество);
			#Иначе
				ЗаписьЖурналаРегистрации("Принудительная блокировка ЦБ", УровеньЖурналаРегистрации.Информация, ЭтотОбъект.Метаданные(), , "В таблице блокировки есть данные с отрицательным количеством по: " + Строка.Клиент+" / "+Строка.СчетДепо+" / "+Строка.СчетДепоРаздел+" / Количество: "+Строка.Количество); 
			#КонецЕсли
		КонецЕсли;		
	КонецЦикла;
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	СтандартнаяОбработка= Ложь;
	
	Префикс = НумераторыОбъектов.ПолучитьПрефиксНомера(ЭтотОбъект);
	
	Номер = НумераторыОбъектов.ПолучитьНомерДокумента(ЭтотОбъект, Префикс);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	СписокДанныхБлокировки.Очистить();
	
	Автор	= Справочники.Пользователи.ПустаяСсылка();
	Изменил	= Справочники.Пользователи.ПустаяСсылка();
КонецПроцедуры

Процедура ЗаполнитьДанныеБлокировки() Экспорт
	СписокДанныхБлокировки.Очистить();
	
	Если ЭтоНовый() Тогда
		ГраницаРасчета	= Дата;
	Иначе
		ГраницаРасчета	= Новый Граница(МоментВремени(), ВидГраницы.Исключая);
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ОстаткиЦБОстатки.СчетДепо.Владелец	КАК Клиент,
	|	ОстаткиЦБОстатки.СчетДепо			КАК СчетДЕПО,
	|	ОстаткиЦБОстатки.РазделСчетаДепо	КАК СчетДепоРаздел,
	|	ОстаткиЦБОстатки.СтатусЦБ			КАК ЦеннаяБумагаСтатус,
	|	ОстаткиЦБОстатки.КоличествоОстаток 	КАК Количество
	|ИЗ
	|	РегистрНакопления.ОстаткиЦБ.Остатки(
	|										&ПериодЗапроса,
	|										СчетДепоМХ = &МестоХраненияСчетДепо
	|										И РазделСчетаДепоМХ = &МестоХраненияСчетДепоРаздел
	|										И ЦБ = &ЦеннаяБумага
	|										) КАК ОстаткиЦБОстатки");

	Запрос.УстановитьПараметр("ПериодЗапроса"				, ГраницаРасчета);
	Запрос.УстановитьПараметр("МестоХраненияСчетДепоРаздел"	, МестоХраненияСчетДепоРаздел);
	Запрос.УстановитьПараметр("МестоХраненияСчетДепо"		, МестоХраненияСчетДепо);
	Запрос.УстановитьПараметр("ЦеннаяБумага"				, ЦеннаяБумага);
	
	СписокДанныхБлокировки.Загрузить(Запрос.Выполнить().Выгрузить());	
КонецПроцедуры

Функция ПолучитьДанныеПоРазделамБлокирования()
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТЗ.Клиент,
	|	ТЗ.СчетДепо,
	|	ТЗ.СчетДепоРаздел,
	|	ТЗ.ЦеннаяБумагаСтатус,
	|	ТЗ.Количество
	|ПОМЕСТИТЬ СписокДанныхБлокировки
	|ИЗ
	|	&СписокДанныхБлокировки	КАК ТЗ;
	|
	|///////////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	СДБ.Клиент,
	|	СДБ.СчетДепо,
	|	СДБ.СчетДепоРаздел,
	|	РСД.Ссылка				КАК СчетДепоРазделБлокирования,
	|	СДБ.ЦеннаяБумагаСтатус,
	|	СДБ.Количество
	|ИЗ
	|	СписокДанныхБлокировки КАК СДБ
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	Справочник.РазделыСчетаДепо КАК РСД
	|ПО
	|	СДБ.СчетДепо = РСД.Владелец
	|И
	|	РСД.ТипРазделаСчетаДЕПО = ЗНАЧЕНИЕ(Перечисление.ТипыРазделовСчетовДЕПО.БлокированоКД)
	|И
	|	(НЕ РСД.ПометкаУдаления ИЛИ РСД.ПометкаУдаления ЕСТЬ NULL)
	|	И
	|	(
	|		(
	|		НЕ РСД.СтатусСчетаДепо = ЗНАЧЕНИЕ(Перечисление.СтатусыСчетовДепо.Закрыт)
	|		ИЛИ
	|		РСД.ДатаЗакрытияСчета > &ДатаЗапроса
	|		)
	|	ИЛИ
	|	РСД.Ссылка ЕСТЬ NULL
	|	ИЛИ
	|	РСД.Ссылка = НЕОПРЕДЕЛЕНО
	|	ИЛИ
	|	РСД.Ссылка = ЗНАЧЕНИЕ(Справочник.РазделыСчетаДепо.ПустаяСсылка)
	|	);"
	);

	Запрос.УстановитьПараметр("СписокДанныхБлокировки"	, СписокДанныхБлокировки.Выгрузить());
	Запрос.УстановитьПараметр("ДатаЗапроса"				, Дата);
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Функция ПолучитьРазделБлокирования(ДанныеБлокировки, Поручение)
	РазделыСчетовДепо	= Справочники.РазделыСчетаДепо;
	ОтборРаздела		= Новый Структура("ВходящийНомерПоручения",  Поручение); 
	ВыборкаРаделов		= РазделыСчетовДепо.Выбрать(, ДанныеБлокировки.СчетДепо, ОтборРаздела);
	
	Пока ВыборкаРаделов.Следующий()  Цикл
		Возврат ВыборкаРаделов.Ссылка;
	КонецЦикла;
КонецФункции

Процедура СоздатьПоручениеНаОткрытиеРазделаБлокирования(ДанныеБлокировки, ДанныеПоРазделамБлокирования)
	Поручение	= Документы.Поручение.СоздатьДокумент();
	Поручение.ДокументОснование			= Ссылка;
	Поручение.Дата						= Дата;
	Поручение.ДатаИсполненияПоручения	= Дата;
	Поручение.ВидОперацииД				= Справочники.ВидыОпераций.ОткрытиеРазделаСчетаДепо;
	Поручение.Инициатор					= Инициатор;
	Поручение.Депонент					= ДанныеБлокировки.Клиент;
	Поручение.СчетДепо					= ДанныеБлокировки.СчетДепо;
	Поручение.ТипРазделаСчетаДЕПО		= Перечисления.ТипыРазделовСчетовДЕПО.БлокированоКД;
	Поручение.Комментарий				= Комментарий;
	Поручение.Записать(РежимЗаписиДокумента.Проведение);

	ТекстСообщения = "Создано поручение на 'Открытие раздела счета ДЕПО' для 'Блокирования' - " + Поручение.Ссылка; 
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = ТекстСообщения;
	Сообщение.Сообщить();

	// Получим счет Депо блокирования
	РазделБлокирования	= ПолучитьРазделБлокирования(ДанныеБлокировки, Поручение.Ссылка);
	СтрокиСчетаДепо		= ДанныеПоРазделамБлокирования.НайтиСтроки(Новый Структура("СчетДепо", ДанныеБлокировки.СчетДепо));
	Для Каждого СтрокаСчета  Из СтрокиСчетаДепо Цикл
		СтрокаСчета.СчетДепоРазделБлокирования	= РазделБлокирования;
	КонецЦикла;
КонецПроцедуры

Процедура СоздатьПоручениеНаБлокирование(ДанныеБлокировки)
	Поручение	= Документы.Поручение.СоздатьДокумент();
	// Заполняем шапку документа	
	Поручение.ДокументОснование			= Ссылка;
	Поручение.Дата						= Дата;
	Поручение.ДатаИсполненияПоручения	= Дата;
	Поручение.ВидОперацииД				= Справочники.ВидыОпераций.Блокирование;
	Поручение.Инициатор					= Инициатор;
	// Заполняем данные депонента
	Поручение.Депонент					= ДанныеБлокировки.Клиент;
	Поручение.СчетДепо					= ДанныеБлокировки.СчетДепо;
	Поручение.РазделСчетаДепо			= ДанныеБлокировки.СчетДепоРаздел;
	Поручение.МХДепонента				= МестоХранения;
	Поручение.СчетДепоМХ				= МестоХраненияСчетДепо;
	Поручение.РазделСчетаДепоМХ			= МестоХраненияСчетДепоРаздел;
	// Заполняем данные контрагента
	Поручение.Контрагент				= ДанныеБлокировки.Клиент;
	Поручение.СчетДепоКонтрагента		= ДанныеБлокировки.СчетДепо;
	Поручение.РазделСчетаДепоКонтрагента= ДанныеБлокировки.СчетДепоРазделБлокирования;
	Поручение.КраткийКодНРД				= Поручение.РазделСчетаДепоКонтрагента.КраткийКодНРД;
	Поручение.МХКонтрагент				= МестоХранения;
	// Заполняем данные ЦБ
	Поручение.ЦБ						= ЦеннаяБумага;
	Поручение.КоличествоЦБ				= ДанныеБлокировки.Количество;
	// Заполняем комментарий
	Поручение.Комментарий				= Комментарий;
	// Проводим документ
	Поручение.Записать(РежимЗаписиДокумента.Проведение);
	// Сообщим о созданном поручении
	#Если Клиент Тогда
		Сообщить("Создано поручение на 'Блокирование' - " + Поручение.Ссылка);
	#Иначе
		ЗаписьЖурналаРегистрации("Принудительная блокировка ЦБ", УровеньЖурналаРегистрации.Информация, Поручение.Метаданные(), Поручение.Ссылка, "Создано поручение на 'Блокирование' - " + Поручение.Ссылка); 
	#КонецЕсли
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	// Т.к. создается сложная операция, то осуществляем все действия транзакционно
	НачатьТранзакцию();
	// Получим данные блокировки
	ДанныеПоРазделамБлокирования	= ПолучитьДанныеПоРазделамБлокирования();
	// Обходим подготовленные данные блокировки
	Для Каждого Строка Из ДанныеПоРазделамБлокирования Цикл
		// Проверяем есть ли раздел блокирования и если нет, то создаем
		Если Не ЗначениеЗаполнено(Строка.СчетДепоРазделБлокирования) Тогда
			СоздатьПоручениеНаОткрытиеРазделаБлокирования(Строка, ДанныеПоРазделамБлокирования);
		КонецЕсли;
		// Формируем документы блокирования
		СоздатьПоручениеНаБлокирование(Строка);
	КонецЦикла;
	// Все прошло ровно - коммитим данные в базу
	ЗафиксироватьТранзакцию();
КонецПроцедуры

Функция ПолучитьСписокПодчиненныхПоручений()
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Поручение.Ссылка
	|ИЗ
	|	Документ.Поручение КАК Поручение
	|ГДЕ
	|	Поручение.ДокументОснование = &ДокументОснование"
	);

	Запрос.УстановитьПараметр("ДокументОснование", Ссылка);
	
	Возврат Запрос.Выполнить().Выгрузить();	
КонецФункции

Процедура ОбработкаУдаленияПроведения(Отказ)
	ТаблицаПоручений	= ПолучитьСписокПодчиненныхПоручений();
	
	Для Каждого Строка Из ТаблицаПоручений Цикл
		ОбъектПоручение	= Строка.Ссылка.ПолучитьОбъект();
		ОбъектПоручение.УстановитьПометкуУдаления(Истина);
		ОбъектПоручение.Записать();
	КонецЦикла;	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	ТаблицаПоручений	= ПолучитьСписокПодчиненныхПоручений();
	
	Для Каждого Строка Из ТаблицаПоручений Цикл
		ОбъектПоручение	= Строка.Ссылка.ПолучитьОбъект();
		ОбъектПоручение.Удалить();
	КонецЦикла;	
КонецПроцедуры
